_draft/resume.org
* 简历 -- 应聘iOS开发
** 工程师的觉悟 
*** 什么是软件?
    软件是一种魔法，从迷幻的原始数据中，变化出惊人的作品， 工程师就是那个念咒语的术士。
*** 如何界定一个工程师的品质
    观察他遇到测试报告中,责任归属不明显的问题时的反应：

    推脱回避，心安理得，是普通工程师。

    积极排查，精神亢奋，是好工程师。 

*** 为什么项目开发进度落后?
    原因1：你团队成员人数太多了,沟通成本过高。

    原因2：你团队缺少精神亢奋的工程师。
** 自我介绍
   杨华寿，9年软件开发经验, 熟悉嵌入式，后端，现今就职于SmartCoach公司， 从事iOS开发工作

曾用3个周末时间完成 “[[https://itunes.apple.com/us/app/zhong-gu-gang-qin-da-quan/id1192492032?mt=8][中古钢琴大全]]” App的iOS端和服务端,解决了钢琴市场信息缺乏的问题。在“流行钢琴网”论坛中，得到精华好评.

博客地址：https://dgutyanghs.github.io/

*** 基本信息
|----------+--------------------|
| 姓名     | 杨华寿             |
|----------+--------------------|
| 出生年月 | /1984-08/            |
| 学历     | /本科/               |
| 民族     | /汉族/               |
| 毕业院校 | /东莞理工学院/       |
| 电话     | /137 9857 3121/      |
| 邮箱     | /dgutyang@gmail.com/ |
*** 工作概述
    自从2007年毕业后,作为 *嵌入式软件工程师* ,从事电视机系统和LED视频处理器开发工作. 多次技术支持TCL,海尔,海信的项目.

2014年初投身移动 *iOS* 开发,主要方向是 *蓝牙穿戴设备* , *智能家居* .
*** 工作经历 
**** 深圳市杰思创科技有限公司
***** 职位
      从 *嵌入式工程师* 晋升 *高级软件工程师*          =2007/07 -- 2014/03= 
***** 职责
      制定开发计划,监控进度.

      对外合作,解决客户技术问题.

      培养初级工程师,解决技术疑难.

***** 主要业绩
|-----------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| 业绩标题                         | 业绩详述                                                                                                                                                                   |
|-----------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| 宝蓝电视系列热销断货              | /作为主力工程师技术支持海尔， 开发‘宝蓝’系列电视机,取得巨大成功.市场脱销，下单后，需等1个月才能提货/                                                                    |
|-----------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| 惠州机场显示器成功中标量产        | /作为项目组长，带领团队按时完成高稳定性的开发任务。成功量产，夯实公司与TCL后续合作的基础。/                                                                                 |
|-----------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| 支援TCL医疗显示器项目             | /同事负责的医疗显示器项目，硬件方案使用到的IC多，驱动复杂，调试困难，造成项目进度落后。故公司增派我支援，帮助解决相关的驱动问题,保证了项目进度。/ |
|-----------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| 开发LED视频处理器，公司开拓新市场 | /作为技术负责人,带领团队完成按时开发任务,LVP3000处理器成功从该行业巨头抢占30%的低端市场.公司凭借此成功进入视频处理器行业./                                                 |
|-----------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------|

















**** 聚码科技--深圳分部 
***** 职位
      *iOS高级工程师*                 =2014/04 -- 2015/05=
***** 职责
      蓝牙BLE SDK的开发和发布。
      
      与嵌入式工程师共同制定蓝牙到APP端的通讯协议。
      
      对外提供解决方案,解决客户技术问题.

***** 主要业绩
|--------------------------------+---------------------------------------------------------------------------|
| 业绩标题                       | 业绩详述                                                                 |
|--------------------------------+---------------------------------------------------------------------------|
| iOS 蓝牙SDK v0.5.2版，封装完成 | /为业务逻辑层提供简单方便的接口，提高团队的开发效率。/                      |
|--------------------------------+---------------------------------------------------------------------------|
| 完成公司蓝牙协议制定           | /规范了公司的协议命令，与各种蓝牙设备一一对应,解决原来协议格式混乱问题。/  |
|--------------------------------+---------------------------------------------------------------------------|
| 完成LED五彩调光颜色灯项目      | /公司首个对外合作项目，向下游LED厂商提供整套的解决方案。为公司赢得2K订单。/ |
|--------------------------------+---------------------------------------------------------------------------|














**** 深圳前海慧练天下网络科技有限公司(SmartCoach)

***** 职位
      *iOS高级工程师*   =2015/05 -- 至今= 
***** 职责
      移动端开发工作量评估，Scrum敏捷开发.
      
      与嵌入式工程师制定蓝牙BLE的通讯接口。
      
      与服务器后端工程师制定RESTful API接口
      
      指导初级工程师,解决开发中遇到的疑难.

***** 主要业绩
|------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| 业绩标题         | 业绩详述                                                                                                                                                                                  |
|------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| 智能运动内衣项目 | /参加2016紫荆之星商业模式大赛，获“紫荆之星”奖。 参加首届中国（深圳）国际时尚科技节 “优秀项目”奖项，同时获得FTIA时尚设计协会的天使投资。/                                      |
|------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| 规范公司开发流程 | /原来公司的嵌入式，移动端，后端人员各自开发，对接联调效率低下，争执不断。 后来我协调各团队将功能模块划分清楚，规范接口。各自按接口开发，提高效率，凝聚团队。使“舒萨运动”顺利上线/ |
|------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|







*** 专业技能
    扎实的C语言基础， 熟悉Objective-c , 了解swift，python 
    
    熟悉Linux环境Shell操作命令, 自己搭建的阿里云服务器， 为App"[[https://itunes.apple.com/us/app/zhong-gu-gang-qin-da-quan/id1192492032?mt=8][中古钢琴大全]] "数据RESTfull接口 . 
    
    了解HTML+CSS，自己的搭建过 [[https://dgutyanghs.github.io][博客 ]]网页。
    
    嵌入式硬件的基础知识(I2C,GPIO等)。 
    
    熟练在Git环境下进行团队协作开发.
    
    熟悉常用的软件设计模式。 
    
    英语4级，能轻松应对英文技术文档 

*** 项目经验

**** 智能运动内衣
***** 背景介绍：
      智能运动内衣是将硬件植入内衣中，成为一体。收集用户数据，监控实时心率，进行HRV心率变异性分析，提供健康导向给用户.
***** 开发任务： 
      穿戴硬件方案设计;
      
      BLE通讯协议接口设计;
      
      大量HRV心率数据同步方案设计;
      
      服务器通讯接口设计;

      UI交互界面;
***** 技术难点
      用户完成运动后，大量HRV数据压缩后同步到手机端时，如何恢复用户的运动记录的时间点？

      面对大量的HRV数据，如何分析出用户的多次运动对应的每一次结果。
***** 解决方案
      问题1：硬件记录HRV数据时间，同步时，加在每个Packet的payload中传输到手机端，由App端恢复时间点。
      问题2：分析两次心跳间隔的时间曲线，再根据运动实测的数据，对比得出用户的运动状态：开始跑步，跑步持续，跑步完成等。
***** 个人负责部分 
      封装AFNetworking网络模块，使用Block回调方式，完成对基本的HTTP方法，基本POST，文件上传，图片下载接口的二次封装。
      封装CoreBluetooth蓝牙模块。开启一个Serial队列，来runloop蓝牙任务，用Block回调到主线程,为业务层提供接口.
      为嵌入式工程师，开发“SportWear”小工具，提高他的调试效率。

**** 舒萨运动

***** 背景介绍：
      公司计划快速开发上线的一个运动健身App，向投资人展示。
***** 开发任务： 
      45天内完成全部开发，上架AppStore。
      根据BMI用户的运动处方生成，更新。
      绘制跑步轨迹的地图线路.
      力量运动的说明与计时。
      运动圈的发帖分享点赞功能。
***** 技术难点
      开发时间紧，而6个的成员除我外,工作年验都少于2年.
      由于缺少系统集成,移动端和后端得交互接口混乱，导致的系统不稳定。

***** 解决方案
# 1.用户实时跑步地图路线绘制,由于GPS信号不稳，偏离实际轨迹问题. 
# 1.设定timer去读取用户位置信息，先不绘制线路，保存起来，直到5个位置，分析其中的正确性,排除错误的位置。
    我及时和产品经理沟通，确定优先要开发模块后，将模块细化成一个个功能.
    以用户运动处方数据基础为出发点， 理清整个App的数据定义和流向，从而确定相关的接口，以此来指导前端，后端的开发。
    遵循敏捷开发模式Scrum来实施计划，设定一周为一个Spring冲刺.
    每天站立会议,分配任务,下班前的检查验收。每个冲刺结束后，验收总结。

***** 经验收获
      项目及时交付上线，获得天使投资一百万。
      真诚地对待每个队友的问题，才能团结团队达成目标。
**** 中古钢琴大全
***** 背景介绍：
      因相关的信息缺乏，在买钢琴时有被商家坑骗经历。遂开始收集大量的钢琴型号资料。将它做成App发布,供家长们参考。
***** 开发任务： 
      如果只有移动端， 后续钢琴数据将无法更新给用户。故须增加后端服务器。
      刚有数据，不够形象，要让家长了解钢琴的制造过程。故有必要增加相关视频内容。
***** 解决方案
      App端：在线视频播放器实现。
      App端：Sqlite数据库操作，使用FMDB第三库。
      后端： Web服务器的搭建，Nginx文件配置，MySQL数据库安装使用。
      后端： RESTfull接口实现，钢琴数据查询，图片下载等接口的实现(使用python的Flask框架)。
***** 经验收获
      服务器搭建过程，虽然踩了不少坑，但是收获也不少。使自己熟悉了后端开发的技术：
      服务器API接口实现，FFMPEG 视频转码，Nginx文件配置，https证书生成。 

** 致谢
认真对待时间，是最节省时间的方式。
感谢您能看到这里。
如果合适，请给我打电话。

#+BEGIN_EXAMPLE
       杨华寿  

    137 9857 3121

  dgutyang@gmail.com
#+END_EXAMPLE




