_draft/resume.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-05-02 Tue 01:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content=" BlueYang" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb18db55">1. 简历 &#x2013; 应聘iOS开发</a>
<ul>
<li><a href="#org19663f8">1.1. 工程师的觉悟</a>
<ul>
<li><a href="#org202a9bd">1.1.1. 什么是软件?</a></li>
<li><a href="#org8304af1">1.1.2. 如何界定一个工程师的品质</a></li>
<li><a href="#org22a028d">1.1.3. 为什么项目开发进度落后?</a></li>
</ul>
</li>
<li><a href="#org0af4d16">1.2. 自我介绍</a>
<ul>
<li><a href="#org05a31af">1.2.1. 基本信息</a></li>
<li><a href="#orgc62bda1">1.2.2. 工作概述</a></li>
<li><a href="#orgbb33b4b">1.2.3. 工作经历</a></li>
<li><a href="#org5813ddc">1.2.4. 专业技能</a></li>
<li><a href="#org2edbfff">1.2.5. 项目经验</a></li>
</ul>
</li>
<li><a href="#org0c8aaa3">1.3. 致谢</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb18db55" class="outline-2">
<h2 id="orgb18db55"><span class="section-number-2">1</span> 简历 &#x2013; 应聘iOS开发</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org19663f8" class="outline-3">
<h3 id="org19663f8"><span class="section-number-3">1.1</span> 工程师的觉悟</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-org202a9bd" class="outline-4">
<h4 id="org202a9bd"><span class="section-number-4">1.1.1</span> 什么是软件?</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
软件是一种魔法，从迷幻的原始数据中，变化出惊人的作品， 工程师就是那个念咒语的术士。
</p>
</div>
</div>
<div id="outline-container-org8304af1" class="outline-4">
<h4 id="org8304af1"><span class="section-number-4">1.1.2</span> 如何界定一个工程师的品质</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
观察他遇到测试报告中,责任归属不明显的问题时的反应：
</p>

<p>
推脱回避，心安理得，是普通工程师。
</p>

<p>
积极排查，精神亢奋，是好工程师。 
</p>
</div>
</div>

<div id="outline-container-org22a028d" class="outline-4">
<h4 id="org22a028d"><span class="section-number-4">1.1.3</span> 为什么项目开发进度落后?</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
原因1：你团队成员人数太多了,沟通成本过高。
</p>

<p>
原因2：你团队缺少精神亢奋的工程师。
</p>
</div>
</div>
</div>
<div id="outline-container-org0af4d16" class="outline-3">
<h3 id="org0af4d16"><span class="section-number-3">1.2</span> 自我介绍</h3>
<div class="outline-text-3" id="text-1-2">
<p>
杨华寿，9年软件开发经验, 熟悉嵌入式，后端，现今就职于SmartCoach公司， 从事iOS开发工作
</p>

<p>
曾用3个周末时间完成 “<a href="https://itunes.apple.com/us/app/zhong-gu-gang-qin-da-quan/id1192492032?mt=8">中古钢琴大全</a>” App的iOS端和服务端,解决了钢琴市场信息缺乏的问题。在“流行钢琴网”论坛中，得到精华好评.
</p>

<p>
博客地址：<a href="https://dgutyanghs.github.io/">https://dgutyanghs.github.io/</a>
</p>

<p>
"中古钢琴大全":<a href="https://itunes.apple.com/us/app/zhong-gu-gang-qin-da-quan/id1192492032?mt=8">https://itunes.apple.com/us/app/zhong-gu-gang-qin-da-quan/id1192492032?mt=8</a>
</p>
</div>
<div id="outline-container-org05a31af" class="outline-4">
<h4 id="org05a31af"><span class="section-number-4">1.2.1</span> 基本信息</h4>
<div class="outline-text-4" id="text-1-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">姓名</th>
<th scope="col" class="org-left">杨华寿</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">出生年月</td>
<td class="org-left">1984-08</td>
</tr>

<tr>
<td class="org-left">学历</td>
<td class="org-left">本科</td>
</tr>

<tr>
<td class="org-left">民族</td>
<td class="org-left">汉族</td>
</tr>

<tr>
<td class="org-left">毕业院校</td>
<td class="org-left">东莞理工学院</td>
</tr>

<tr>
<td class="org-left">电话</td>
<td class="org-left">137 9857 3121</td>
</tr>

<tr>
<td class="org-left">邮箱</td>
<td class="org-left">dgutyang@gmail.com</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgc62bda1" class="outline-4">
<h4 id="orgc62bda1"><span class="section-number-4">1.2.2</span> 工作概述</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
自从2007年毕业后,作为 <b>嵌入式软件工程师</b> ,从事电视机系统和LED视频处理器开发工作. 多次技术支持TCL,海尔,海信的项目.
</p>

<p>
2014年初投身移动 <b>iOS</b> 开发,主要方向是 <b>蓝牙穿戴设备</b> , <b>智能家居</b> .
</p>
</div>
</div>
<div id="outline-container-orgbb33b4b" class="outline-4">
<h4 id="orgbb33b4b"><span class="section-number-4">1.2.3</span> 工作经历</h4>
<div class="outline-text-4" id="text-1-2-3">
</div><ol class="org-ol"><li><a id="org60feb64"></a>深圳市杰思创科技有限公司<br /><ol class="org-ol"><li><a id="org1df5e75"></a>职位<br /><div class="outline-text-6" id="text-1-2-3-1-1">
<p>
从 <b>嵌入式工程师</b> 晋升 <b>高级软件工程师</b>          <code>2007/07 -- 2014/03</code> 
</p>
</div></li>
<li><a id="org1ec3961"></a>职责<br /><div class="outline-text-6" id="text-1-2-3-1-2">
<p>
制定开发计划,监控进度.
</p>

<p>
对外合作,解决客户技术问题.
</p>

<p>
培养初级工程师,解决技术疑难.
</p>
</div></li>

<li><a id="orgad6badb"></a>主要业绩<br /><div class="outline-text-6" id="text-1-2-3-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">宝蓝电视系列热销断货</th>
<th scope="col" class="org-left">作为主力工程师技术支持海尔， 开发‘宝蓝’系列电视机,取得巨大成功.市场脱销，下单后，需等1个月才能提货</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">惠州机场显示器成功中标量产</td>
<td class="org-left">作为项目组长，带领团队按时完成高稳定性的开发任务。成功量产，夯实公司与TCL后续合作的基础。</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">支援TCL医疗显示器项目</td>
<td class="org-left">同事负责的医疗显示器项目，硬件方案使用到的IC多，驱动复杂，调试困难，造成项目进度落后。故公司增派我支援，帮助解决相关的驱动问题（sensor，HDMI switch等），保证了项目进度。</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">开发LED视频处理器，公司开拓新市场</td>
<td class="org-left">作为技术负责人,带领团队完成按时开发任务,LVP3000处理器成功从该行业巨头抢占30%的低端市场.公司凭借此成功进入视频处理器行业.</td>
</tr>
</tbody>
</table>
</div></li></ol></li>

















<li><a id="org70f95bc"></a>聚码科技&#x2013;深圳分部<br /><ol class="org-ol"><li><a id="org6422976"></a>职位<br /><div class="outline-text-6" id="text-1-2-3-2-1">
<p>
<b>iOS高级工程师</b>                 <code>2014/04 -- 2015/05</code>
</p>
</div></li>
<li><a id="orgab5e20b"></a>职责<br /><div class="outline-text-6" id="text-1-2-3-2-2">
<p>
蓝牙BLE SDK的开发和发布。
</p>

<p>
与嵌入式工程师共同制定蓝牙到APP端的通讯协议。
</p>

<p>
对外提供解决方案,解决客户技术问题.
</p>
</div></li>

<li><a id="org54388c5"></a>主要业绩<br /><div class="outline-text-6" id="text-1-2-3-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">iOS 蓝牙SDK v0.5.2版，封装完成</th>
<th scope="col" class="org-left">为业务逻辑层提供简单方便的接口，提高团队的开发效率。</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">完成公司蓝牙协议制定</td>
<td class="org-left">规范了公司的协议命令，与各种蓝牙设备一一对应,解决原来协议格式混乱问题。</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">完成LED五彩调光颜色灯项目</td>
<td class="org-left">公司首个对外合作项目，向下游LED厂商提供整套的解决方案。为公司赢得2K订单。</td>
</tr>
</tbody>
</table>
</div></li></ol></li>














<li><a id="orgd4f90af"></a>深圳前海慧练天下网络科技有限公司(SmartCoach)<br /><ol class="org-ol"><li><a id="org43628cc"></a>职位<br /><div class="outline-text-6" id="text-1-2-3-3-1">
<p>
<b>iOS高级工程师</b>   <code>2015/05 -- 至今</code> 
</p>
</div></li>
<li><a id="org3cd0c94"></a>职责<br /><div class="outline-text-6" id="text-1-2-3-3-2">
<p>
移动端开发工作量评估，Scrum敏捷开发.
</p>

<p>
与嵌入式工程师制定蓝牙BLE的通讯接口。
</p>

<p>
与服务器后端工程师制定RESTful API接口
</p>

<p>
指导初级工程师,解决开发中遇到的疑难.
</p>
</div></li>

<li><a id="org0fa126b"></a>主要业绩<br /><div class="outline-text-6" id="text-1-2-3-3-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">智能运动内衣项目</th>
<th scope="col" class="org-left">参加2016紫荆之星商业模式大赛，获“紫荆之星”奖。 参加首届中国（深圳）国际时尚科技节 “优秀项目”奖项，同时获得FTIA时尚设计协会的天使投资。</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">规范公司开发流程</td>
<td class="org-left">原来公司的嵌入式，移动端，后端人员各自开发，对接联调效率低下，争执不断。 后来我协调各团队将功能模块划分清楚，规范接口。各自按接口开发，提高效率，凝聚团队。使“舒萨运动”顺利上线</td>
</tr>
</tbody>
</table>
</div></li></ol></li></ol>
</div>







<div id="outline-container-org5813ddc" class="outline-4">
<h4 id="org5813ddc"><span class="section-number-4">1.2.4</span> 专业技能</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
扎实的C语言基础， 熟悉Objective-c , 了解swift，python 
</p>

<p>
熟悉Linux环境Shell操作命令, 自己搭建的阿里云服务器， 为App"<a href="https://itunes.apple.com/us/app/zhong-gu-gang-qin-da-quan/id1192492032?mt=8">中古钢琴大全</a> "数据RESTfull接口 . 
</p>

<p>
了解HTML+CSS，自己的搭建过 <a href="https://dgutyanghs.github.io">博客 </a>网页。
</p>

<p>
嵌入式硬件的基础知识(I2C,GPIO等)。 
</p>

<p>
熟练在Git环境下进行团队协作开发.
</p>

<p>
熟悉常用的软件设计模式。 
</p>

<p>
英语4级，能轻松应对英文技术文档 
</p>
</div>
</div>

<div id="outline-container-org2edbfff" class="outline-4">
<h4 id="org2edbfff"><span class="section-number-4">1.2.5</span> 项目经验</h4>
<div class="outline-text-4" id="text-1-2-5">
</div><ol class="org-ol"><li><a id="orgd89b8ad"></a>智能运动内衣<br /><ol class="org-ol"><li><a id="org0bffe56"></a>背景介绍：<br /><div class="outline-text-6" id="text-1-2-5-1-1">
<p>
智能运动内衣是将硬件植入内衣中，成为一体。收集用户数据，监控实时心率，进行HRV心率变异性分析，提供健康导向给用户.
</p>
</div></li>
<li><a id="org3bbe412"></a>开发任务：<br /><div class="outline-text-6" id="text-1-2-5-1-2">
<p>
1.穿戴硬件方案设计;
</p>

<p>
2.BLE通讯协议接口设计;
</p>

<p>
3.大量HRV心率数据同步方案设计;
</p>

<p>
4.服务器通讯接口设计;
</p>

<p>
5.UI交互界面;
</p>
</div></li>
<li><a id="org7c83af6"></a>技术难点<br /><div class="outline-text-6" id="text-1-2-5-1-3">
<p>
1.用户完成运动后，大量HRV数据压缩后同步到手机端时，如何恢复用户的运动记录的时间点？
</p>

<p>
2.面对大量的HRV数据，如何分析出用户的多次运动对应的每一次结果。
</p>
</div></li>
<li><a id="orgf5d3897"></a>解决方案<br /><div class="outline-text-6" id="text-1-2-5-1-4">
<p>
问题1：硬件记录HRV数据时间，同步时，加在每个Packet的payload中传输到手机端，由App端恢复时间点。
问题2：分析两次心跳间隔的时间曲线，再根据运动实测的数据，对比得出用户的运动状态：开始跑步，跑步持续，跑步完成等。
</p>
</div></li>
<li><a id="org7b2762b"></a>个人负责部分<br /><div class="outline-text-6" id="text-1-2-5-1-5">
<p>
1.封装AFNetworking网络模块，使用Block回调方式，完成对基本的HTTP方法，基本POST，文件上传，图片下载接口的二次封装。
2.封装CoreBluetooth蓝牙模块。开启一个Serial队列，来runloop蓝牙任务，用Block回调到主线程,为业务层提供接口.
3.为嵌入式工程师，开发“SportWear”小工具，提高他的调试效率。
</p>
</div></li></ol></li>

<li><a id="orgf942c31"></a>舒萨运动<br /><ol class="org-ol"><li><a id="org00f116a"></a>背景介绍：<br /><div class="outline-text-6" id="text-1-2-5-2-1">
<p>
公司计划快速开发上线的一个运动健身App，向投资人展示。
</p>
</div></li>
<li><a id="orgd454c17"></a>开发任务：<br /><div class="outline-text-6" id="text-1-2-5-2-2">
<p>
45天内完成全部开发，上架AppStore。
根据BMI用户的运动处方生成，更新。
绘制跑步轨迹的地图线路.
力量运动的说明与计时。
运动圈的发帖分享点赞功能。
</p>
</div></li>
<li><a id="org9e1d421"></a>技术难点<br /><div class="outline-text-6" id="text-1-2-5-2-3">
<p>
开发时间紧，而6个的成员除我外,工作年验都少于2年.
由于缺少系统集成,移动端和后端得交互接口混乱，导致的系统不稳定。
</p>
</div></li>

<li><a id="orge3bff81"></a>解决方案<br /><div class="outline-text-6" id="text-1-2-5-2-4">
<p>
我及时和产品经理沟通，确定优先要开发模块后，将模块细化成一个个功能，以用户运动处方数据基础为出发点， 理清整个App的数据定义和流向，从而确定相关的接口，以此来指导前端，后端的开发。
遵循敏捷开发模式Scrum来实施计划，设定一周为一个Spring冲刺.
每天站立会议,分配任务,下班前的检查验收。每个冲刺结束后，验收总结。
</p>
</div></li>

<li><a id="org6d4e627"></a>经验收获<br /><div class="outline-text-6" id="text-1-2-5-2-5">
<p>
项目及时交付上线，获得天使投资一百万。
真诚地对待每个队友的问题，才能团结团队达成目标。
</p>
</div></li></ol></li>
<li><a id="orgf3ae565"></a>中古钢琴大全<br /><ol class="org-ol"><li><a id="org39ce91f"></a>背景介绍：<br /><div class="outline-text-6" id="text-1-2-5-3-1">
<p>
因相关的信息缺乏，在买钢琴时有被商家坑骗经历。遂开始收集大量的钢琴型号资料。将它做成App发布,供家长们参考。
</p>
</div></li>
<li><a id="org43383bc"></a>开发任务：<br /><div class="outline-text-6" id="text-1-2-5-3-2">
<p>
如果只有移动端， 后续钢琴数据将无法更新给用户。故须增加后端服务器。
刚有数据，不够形象，要让家长了解钢琴的制造过程。故有必要增加相关视频内容。
</p>
</div></li>
<li><a id="orgc89a3d6"></a>解决方案<br /><div class="outline-text-6" id="text-1-2-5-3-3">
<p>
App端：在线视频播放器实现。
App端：Sqlite数据库操作，使用FMDB第三库。
后端： Web服务器的搭建，Nginx文件配置，MySQL数据库安装使用。
后端： RESTfull接口实现，钢琴数据查询，图片下载等接口的实现(使用python的Flask框架)。
</p>
</div></li>
<li><a id="org1d71617"></a>经验收获<br /><div class="outline-text-6" id="text-1-2-5-3-4">
<p>
服务器搭建过程，虽然踩了不少坑，但是收获也不少。使自己熟悉了后端开发的技术：
服务器API接口实现，FFMPEG 视频转码，Nginx文件配置，https证书生成。 
</p>
</div></li></ol></li></ol>
</div>
</div>

<div id="outline-container-org0c8aaa3" class="outline-3">
<h3 id="org0c8aaa3"><span class="section-number-3">1.3</span> 致谢</h3>
<div class="outline-text-3" id="text-1-3">
<p>
认真对待时间，是最节省时间的方式。
感谢您能看到这里。
如果合适，请给我打电话。
</p>

<pre class="example">
     杨华寿  

  137 9857 3121

dgutyang@gmail.com
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  BlueYang</p>
<p class="date">Created: 2017-05-02 Tue 01:22</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
